LordWhiteley-UK/Chatbot-Xiaozhi-ESP32-S3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# XIAO ESP32-S3 (N8R8): 8MB flash, 8MB Octal PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# GPIO43/44 are used for the mic, so console must not be UART0
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# Custom table: adds a "model" partition for the esp-sr wake word
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_SR_WN_WN9_COMPUTER_TTS=y